In [1]:
import pandas as pd
import numpy as np

### Data Collection
#### collect data from books dataset.
#### collect data from user dataset.
#### collect rating data of each book that is rated by reader.

In [2]:
# read data files of books, users and rating
books=pd.read_csv('E:\Big-Data-\Booksdata\Books.csv')
users=pd.read_csv('E:\\Big-Data-\\Booksdata\\Users.csv')
rating=pd.read_csv('E:\\Big-Data-\\Booksdata\\Ratings.csv')

C:\Users\Saddique\anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3165: DtypeWarning: Columns (3) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,

In [3]:
books.head()

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...
2,0060973129,Decision in Normandy,Carlo D'Este,1991,HarperPerennial,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...
3,0374157065,Flu: The Story of the Great Influenza Pandemic...,Gina Bari Kolata,1999,Farrar Straus Giroux,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...
4,0393045218,The Mummies of Urumchi,E. J. W. Barber,1999,W. W. Norton &amp; Company,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...

### Data cleaning
#### select only important columns from data and drop the irrelevent data colums to incrase accuracy
#### Give suitable names to columns that are easy to undrstandabl.

In [4]:
books.columns

Index(['ISBN', 'Book-Title', 'Book-Author', 'Year-Of-Publication', 'Publisher',
       'Image-URL-S', 'Image-URL-M', 'Image-URL-L'],
      dtype='object')

In [5]:
# take columns which are impotant
books=books[['ISBN', 'Book-Title', 'Book-Author', 'Year-Of-Publication', 'Publisher']]

In [6]:
books.head(2)

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada

In [7]:
# rename book columns to give suitable names
books.rename(columns={'Book-Title':'title','Book-Author':'author','Year-Of-Publication':'year','Publisher':'publisher'},inplace=True)

In [8]:
books.head(2)

,ISBN,title,author,year,publisher
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada

In [9]:
users.head(2)

   User-ID                   Location   Age
0        1         nyc, new york, usa   NaN
1        2  stockton, california, usa  18.0

In [10]:
# rename user columns to give suitable names
users.rename(columns={'User-ID':'user_id','Location':'location','Age':'age'},inplace=True)

In [11]:
rating.head(2)

   User-ID        ISBN  Book-Rating
0   276725  034545104X            0
1   276726  0155061224            5

In [12]:
# rename rating columns to give suitable names
rating.rename(columns={'User-ID':'user_id','Book-Rating':'rating'},inplace=True)

In [13]:
rating.head(2)

   user_id        ISBN  rating
0   276725  034545104X       0
1   276726  0155061224       5

In [14]:
books.shape

(271360, 5)

In [15]:
users.shape

(278858, 3)

In [16]:
rating.shape

(1149780, 3)

### Feature Engineering
#### Count those values which are more important  and ignore which are less important.

In [17]:
## identify unique users
rating['user_id'].value_counts().shape

(105283,)

In [18]:
## considering those users who have viewed more than 200 books
x=rating['user_id'].value_counts()>200

In [19]:
x[x].shape

(899,)

In [20]:
y=x[x].index

In [21]:
y

Int64Index([ 11676, 198711, 153662,  98391,  35859, 212898, 278418,  76352,
            110973, 235105,
            ...
            116122,  28634, 188951,  59727, 155916, 274808,  73681,   9856,
            268622,  44296],
           dtype='int64', length=899)

In [22]:
rating=rating[rating['user_id'].isin(y)]
# find user_id with rating who rated books more then 200

In [23]:
rating.shape

(526356, 3)

In [24]:
rating

         user_id        ISBN  rating
1456      277427  002542730X      10
1457      277427  0026217457       0
1458      277427  003008685X       8
1459      277427  0030615321       0
1460      277427  0060002050       0
...          ...         ...     ...
1147612   275970  3829021860       0
1147613   275970  4770019572       0
1147614   275970   896086097       0
1147615   275970  9626340762       8
1147616   275970  9626344990       0

[526356 rows x 3 columns]

In [25]:
rating_with_books=rating.merge(books,on='ISBN')
# merge the dataset  rating_with_books and books or base of ISBN number

In [26]:
rating_with_books.shape

(487671, 7)

In [27]:
number_rating=rating_with_books.groupby('title')['rating'].count().reset_index()
# find  title and rating of books , user rated more then 200 times

In [28]:
number_rating.rename(columns={'rating':'number of rating'},inplace=True)
# change the name of rating

In [29]:
number_rating.head()

                                               title  number of rating
0   A Light in the Storm: The Civil War Diary of ...                 2
1                              Always Have Popsicles                 1
2               Apple Magic (The Collector's series)                 1
3   Beyond IBM: Leadership Marketing and Finance ...                 1
4   Clifford Visita El Hospital (Clifford El Gran...                 1

#### Merging two data sets rating with books and number rating

In [30]:
final_ratings=rating_with_books.merge(number_rating,on='title') 
#merge two datasets rating_with_books with number rating on title

In [31]:
final_ratings.head()

,user_id,ISBN,rating,title,author,year,publisher,number of rating
0,277427,002542730X,10,Politically Correct Bedtime Stories: Modern Ta...,James Finn Garner,1994,John Wiley &amp; Sons Inc,82
1,3363,002542730X,0,Politically Correct Bedtime Stories: Modern Ta...,James Finn Garner,1994,John Wiley &amp; Sons Inc,82
2,11676,002542730X,6,Politically Correct Bedtime Stories: Modern Ta...,James Finn Garner,1994,John Wiley &amp; Sons Inc,82
3,12538,002542730X,10,Politically Correct Bedtime Stories: Modern Ta...,James Finn Garner,1994,John Wiley &amp; Sons Inc,82
4,13552,002542730X,0,Politically Correct Bedtime Stories: Modern Ta...,James Finn Garner,1994,John Wiley &amp; Sons Inc,82

In [32]:
final_ratings.shape

(487671, 8)

In [33]:
final_ratings=final_ratings[final_ratings['number of rating']>=50]
# now, find books of more then 50 ratings

In [34]:
final_ratings.shape

(61853, 8)

In [35]:
final_ratings.drop_duplicates(['user_id','title'],inplace=True) 
## droping the same record \ duplicate record

In [36]:
final_ratings.shape

(59850, 8)

In [37]:
final_ratings.head()

,user_id,ISBN,rating,title,author,year,publisher,number of rating
0,277427,002542730X,10,Politically Correct Bedtime Stories: Modern Ta...,James Finn Garner,1994,John Wiley &amp; Sons Inc,82
1,3363,002542730X,0,Politically Correct Bedtime Stories: Modern Ta...,James Finn Garner,1994,John Wiley &amp; Sons Inc,82
2,11676,002542730X,6,Politically Correct Bedtime Stories: Modern Ta...,James Finn Garner,1994,John Wiley &amp; Sons Inc,82
3,12538,002542730X,10,Politically Correct Bedtime Stories: Modern Ta...,James Finn Garner,1994,John Wiley &amp; Sons Inc,82
4,13552,002542730X,0,Politically Correct Bedtime Stories: Modern Ta...,James Finn Garner,1994,John Wiley &amp; Sons Inc,82

#### Create Pivot Table

#### in pivot table table  set the column name as user id, title of movies on index and set values as rating

In [38]:
book_pivot=final_ratings.pivot_table(columns='user_id',index='title',values='rating') ## pivot table

In [39]:
book_pivot.shape

(742, 888)

In [40]:
book_pivot.fillna(0,inplace=True)

In [57]:
book_pivot.head()

user_id,254,2276,2766,2977,3363,3757,4017,4385,6242,6251,...,274004,274061,274301,274308,274808,275970,277427,277478,277639,278418
title,,,,,,,,,,,,,,,,,,,,,
1984,9.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1st to Die: A Novel,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2nd Chance,0.0,10.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4 Blondes,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
84 Charing Cross Road,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,10.0,0.0,0.0,0.0,0.0

#### Now, deal with non-zero elements so import scipy.spares, Numpy is scientific python library create the object and store
#### the data of pivot table

In [42]:
from scipy.sparse import csr_matrix
book_sparse=csr_matrix(book_pivot)
#csr_matrix ignore null values in pivot table

In [43]:
type(book_sparse)

scipy.sparse.csr.csr_matrix

In [44]:
book_sparse

<742x888 sparse matrix of type '<class 'numpy.float64'>'
	with 14942 stored elements in Compressed Sparse Row format>

### import the Machine Learning model
####  import NearestNeighbors model it is used for clustering the data

In [45]:
from sklearn.neighbors import NearestNeighbors # import NearestNeighbor which divide data into clusters
model=NearestNeighbors()

In [55]:
model.fit(book_sparse)

NearestNeighbors()

In [47]:
distances,suggestions=model.kneighbors(book_pivot.iloc[100,:].values.reshape(1,-1) , n_neighbors=5)
# return two arrays distance, suggestions. it select the row of user_id and display column data(Book titles)
# n_neighbor=5 take five nearest values

In [48]:
distances

array([[ 0.        , 30.78960864, 31.20897307, 32.46536616, 32.74141109]])

In [49]:
suggestions

array([[100, 372, 184, 536, 291]], dtype=int64)

In [50]:
for i in range(len(suggestions)):
    print(book_pivot.index[suggestions[i]])

Index(['Call of the Wild', 'No Safe Place', 'Exclusive',
       'The Cradle Will Fall', 'Jacob Have I Loved'],
      dtype='object', name='title')

In [51]:
book_pivot.index[54]

'Animal Farm'

In [52]:
np.where(book_pivot.index=='Animal Farm')[0][0]
# if we set the name of book then return book_id

54

In [53]:
def recommend_book(bookname):
    book_id=np.where(book_pivot.index==bookname)[0][0]
    distances,suggestions=model.kneighbors(book_pivot.iloc[book_id,:].values.reshape(1,-1) , n_neighbors=5)
    
    for i in range(len(suggestions)):
            print(book_pivot.index[suggestions[i]])

In [54]:
recommend_book('Animal Farm')

Index(['Animal Farm', 'Exclusive', 'Jacob Have I Loved', 'Second Nature',
       'Pleading Guilty'],
      dtype='object', name='title')